app/Controllers/Tugas.php

    public function store()
    {
        $tugasModel = new TugasModel();
        $sharedModel = new SharedModel();

        $file = $this->request->getFile('foto');

        if ($file->isValid() && !$file->hasMoved()) {
            $fileName = $file->getRandomName();
            $file->move('uploads/tugas', $fileName);
        } else {
            $fileName = "avatar.png";
        }

        $dataTugas = [
            'iduser' => $this->request->getPost('iduser'),
            'tugas' => $this->request->getPost('tugas'),
            'tanggal' => $this->request->getPost('tanggal'),
            'waktu' => $this->request->getPost('waktu'),
            'status' => $this->request->getPost('status'),
            'foto' => $fileName
        ];

        // Simpan data tugas
        $tugasModel->save($dataTugas);

        // Ambil ID tugas yang baru disimpan
        $idtugas = $tugasModel->insertID();

        // Tambahkan ke shared untuk user itu sendiri
        $sharedModel->insert([
            'idtugas'    => $idtugas,
            'sharedto'   => $this->request->getPost('iduser'),
            'sharedtype' => 'user',
            'sharedby'   => $this->request->getPost('iduser'),
            'accepted'   => 'todo',
            'shareddate' => date('Y-m-d H:i:s'),
            'acceptdate' => date('Y-m-d H:i:s'),

        ]);
---
INSERT INTO `tugas` (`iduser`, `tugas`, `tanggal`, `waktu`, `status`, `foto`) VALUES ('3', 'naon we', '2025-04-22', '14:57', 'To do', '1745308682_df07764a2985f9dc69b5.png')
INSERT INTO `shared` (`idtugas`, `sharedto`, `sharedby`, `accepted`, `shareddate`, `acceptdate`) VALUES (22, '3', '3', 'todo', '2025-04-22 07:58:02', '2025-04-22 07:58:02')

    public function edit($id)
    {
        $data['title'] = 'Edit tugas';
        $model = new TugasModel();
        $data['tugas'] = $model->find($id);
---
SELECT *
FROM `tugas`
WHERE `tugas`.`id` = '21'

    public function index1()
    {
        $keyword = $this->request->getGet('keyword');
        $perPage = 10;
        $userId = session()->get('id'); // Ambil ID user dari session

        if ($keyword) {
            $tugas = $this->tugasModel
                ->where('iduser', $userId)
                ->like('judul', $keyword) // Ganti field sesuai kebutuhan
                ->paginate($perPage);
        } else {
            $tugas = $this->tugasModel
                ->where('iduser', $userId)
                ->paginate($perPage);
---
SELECT *
FROM `tugas`
WHERE `iduser` = '8'
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `tugas`
WHERE `iduser` = '8'