app/Models/FriendshipModel.php

SELECT `user`.`nama`, `user`.`foto`, `friendships`.*
FROM `friendships`
JOIN `user` ON `user`.`id` = IF(friendships.user_id = 8, friendships.friend_id, friendships.user_id)
WHERE `friendships`.`status` = 'accepted'
AND   (
`friendships`.`user_id` = '8'
OR `friendships`.`friend_id` = '8'
 )
---
    public function getFriends($userId)
    {
        return $this->select('user.nama, user.foto, friendships.*')
            ->join('user', 'user.id = IF(friendships.user_id = ' . $userId . ', friendships.friend_id, friendships.user_id)')
            ->where('friendships.status', 'accepted')
            ->groupStart()
            ->where('friendships.user_id', $userId)
            ->orWhere('friendships.friend_id', $userId)
            ->groupEnd()
            ->findAll();

SELECT `user`.`nama`, `user`.`foto`, `friendships`.*
FROM `friendships`
JOIN `user` ON `user`.`id` = `friendships`.`user_id`
WHERE `friendships`.`friend_id` = '8'
AND `friendships`.`status` = 'pending'
---
    public function getFriendRequests($userId)
    {
        return $this->select('user.nama, user.foto, friendships.*')
            ->join('user', 'user.id = friendships.user_id')
            ->where('friendships.friend_id', $userId)
            ->where('friendships.status', 'pending')
            ->findAll();

SELECT `user`.`nama`, `user`.`foto`, `friendships`.*
FROM `friendships`
JOIN `user` ON `user`.`id` = `friendships`.`friend_id`
WHERE `friendships`.`user_id` = '8'
AND `friendships`.`status` = 'pending'
---
    public function getSentRequests($userId)
    {
        return $this->select('user.nama, user.foto, friendships.*')
            ->join('user', 'user.id = friendships.friend_id')
            ->where('friendships.user_id', $userId)
            ->where('friendships.status', 'pending')
            ->findAll();