app/Models/UserModel.php

    public function getUserByNama($nama)
    {
        return $this->where('nama', $nama)->first();
---
SELECT *
FROM `user`
WHERE `nama` = 'saheela'
 LIMIT 1